000100230214             CALL       STRJOB
000101230214             ADDLIBLE   BCI433LIB
000102230214             MONMSG     MSGID(CPF2103)
000103230214
