000100200323       DCL-F SQLDSP WORKSTN;
000200200323
000300200323       DCL-S  ShipCityNull BinDec (4:0);
000400200323       DCL-S  DiscountNull BinDec (4:0);
000500200323
000600200323       EXFMT RECORD1;
000700200323       DOW NOT (*IN03);
000800200323
000900200323        EXEC SQL
001000200323         SELECT  CUSTID,
001100200323                 NAME,
001200200323                 SHIPCITY,
001300200323                 DISCOUNT
001400200323         INTO    :CUSTID,
001500200323                 :NAME,
001600200323                 :SHIPCITY :SHIPCITYNULL,
001700200323                 :DISCOUNT :DISCOUNTNULL
001800200323         FROM    BCI433LIB/CUSTOMER
001900230328         WHERE   CUSTID > :CustIDin;
002000200323
002100200323         If ShipCityNull = -1;
002200200323           ShipCity = 'Unknown';
002300200323         EndIf;
002400200323
002500200323        If DiscountNull = -1;
002501200323           *in99 = *on;
002502200323         Else;
002503200323           *in99 = *off;
002504200323         EndIf;
002800200323         Write Record1;
002900200323         EXFMT Record2;
003000200323         If *IN03 = *OFF;
003100200323           EXFMT Record1;
003200200323         ENDIF;
003300200323        ENDDO;
003400200323        *INLR = *ON;
003500200323        Return;
