000100220628      //***********************************************************************
000200220628      //* THIS PROGRAM USES A CURSOR TO LOAD A TEMPORARY RESULT TABLE FROM 3
000300220720      //* SEPARATE TABLES, CUSTOMER2, ORDER1 AND ORDERLINE. A NUMBER IS PASSED
000400220628      //* TO THE PROGRAM TO DETERMINE WHICH RECORDS ARE INLCUDED
000500220628      //***********************************************************************
000600211111           DCL-F CUSTREPORT PRINTER OFLIND(*IN01) ;
000700211111           DCL-S OrderNumH    PACKED(5:0);
000800220628      // Declare an indicator to handle end of result set (file)
000900220628
001000220628
001100220628      // All Host Variables available under a single name
001200220628
001300220628
001400220628
001500220628
001600220628
001700220628
001800220628
001900220628
002000220628
002100220628
002200220628
002300220628
002400220628
002500220628       // LimitIn is passed to the program
002600220628
002700220628
002800220628
002900220628
003000220628
003100220628
003200220628
003300220628     // M A I N    R O U T I N E
003400220628
003500220627                SpendLimit = LimitIn;
003600100309                EXSR PrepareFiles;
003700211111                Write ReporTitle;
003800211104                Write ColHeading;
003900100309                EXSR GetRow;
004000221202                If NOT EndOfFile;
004100221202                  Write NextCust;
004200221202                  OrderNumH = OrderNum;
004300221202                EndIf;
004400070202                DOW NOT EndOfFile;
004500190313                    IF *IN01 = *ON;
004600211111                        Write ReporTitle;
004700211104                        Write ColHeading;
004800190313                       *IN01 = *OFF;
004900070209                    ENDIF;
005000220628                    // Handle Control Breaks on Order Number
005100220628
005200220628
005300220628
005400220628
005500220628
005600220628
005700220628
005800220628
005900220628
006000220628
006100220628
006200220628
006300220628
006400220628
006500220628
006600220628
006700211111                    TotalOrd = TotalOrd + ExtPrice;
006800100309                    EXSR GetRow;
006900070119                ENDDO;
007000211111                Write OrdTotal;
007100211111                TotalAll = TotalAll + TotalOrd;
007200211111                Write AllOrders;
007300070202                EXSR   WRAPUP;
007400220627                Write NotInclude;
007500070119                *INLR = *ON;
007600070119                RETURN;
007700100309        //**********************************************************************
007800100309        // O P E N F I L E S   S U B R O U T I N E
007900100309        //**********************************************************************
008000100309         BEGSR  PrepareFiles;
008100220628        // S E T   U P   T H E   T E M P O R A R Y   R E S U L T  S T R U C T U
008200220628
008300220628
008400220628
008500220628
008600220628
008700220628
008800220628
008900220628
009000220628
009100220628
009200220628
009300220628
009400220628
009500220628
009600220628
009700220628
009800220628
009900220628
010000220628
010100220628
010200220628
010300100309
010400100309        // A   T E M P O R A R Y   R E S U L T   T A B L E   I S   C R E A T E D
010500100309        EXEC SQL
010600220628
010700220628
010800220628
010900220628
011000220628
011100220628
011200220628
011300220628
011400220628
011500100309
011600100309            ENDSR;
011700100309        //**********************************************************************
011800100309        //   G E T     R O W    S U B R O U T I N E
011900100309        //**********************************************************************
012000100309            BEGSR     GETROW;
012100220628
012200220628
012300220628
012400220628
012500220628
012600220628
012700220628
012800220628
012900220628
013000220628
013100220628
013200100309
013300100309             ENDSR;
013400100309        //**********************************************************************
013500100309        // W R A P U P     S U B R O U T I N E
013600100309        //**********************************************************************
013700100309           BEGSR WRAPUP;
013800220627
013900220628
014000220628
014100220628
014200220628
014300220628
014400220628
014500220628
014600220628
014700220628
014800220628
014900220628
015000220628
015100220628
015200220628
015300220628
015400220628
015500220628
015600220628
015700100309          ENDSR;
