000100990120
001700960408
002202181115       Dcl-Pr DayOfWeek  ZONED(1);
002203181024         AnyDate  Date;
002204181024       End-Pr;
002205181024
002206181115       Dcl-Pr DayName   Char(9);
002207181024         AnyDate  Date;
002208181024       End-Pr;
002400960402
