000100200402          Dcl-Pr DayNumName Char(9);
000200200402           DayIn Packed(1);
000300181112          End-Pr;
000400181112
000401200727          Dcl-Pr MonthNumName Char(9);
000402200727           DayIn Packed(2);
000403200727          End-Pr;
000500181112
