000100230411      **Free
000101230411        // Protos for rate calculation
000102230411
000103230412        DCL-Pr  CalcRate  Zoned(4:2);
000104230412          TERM  Packed(2);
000105230411        END-PR;
