000100230201       DCL-F  CARPAYDSP  WORKSTN;
000101230201       EXSR  RESET;
000102230201       EXFMT PURCHREC;
000103230201       DOW   *IN03 = *OFF;
000104230201         IF VPRICE <=  0;
000105230201           *IN30 = *ON;
000106230201           EXFMT PURCHREC;
000107230201           *IN30 = *OFF;
000108230201           ITER;
000109230201           ELSE;
000110230207             EXSR GETRATE;
000118230201             EXSR GETPAYMENT;
000119230201           ENDIF;
000120230201           IF RUSTPROTOP = ' ';
000121230201             *IN31 = *ON;
000122230201             EXFMT PURCHREC;
000123230201             *IN31 =*OFF;
000124230201             ITER;
000125230201           ENDIF;
000132230201           IF RATE <= 0;
000133230201             *IN32 = *ON;
000134230201             EXFMT PURCHREC;
000135230201             *IN32 = *OFF;
000136230201             ITER;
000137230201           ENDIF;
000138230201           *IN41 = *ON;
000139230201           WRITE PURCHREC;
000140230201           EXFMT LOANREC;
000141230201           *IN41 = *OFF;
000142230201
000143230201           IF NOT *IN03;
000144230201             EXSR RESET;
000145230201             EXFMT PURCHREC;
000146230201           ENDIF;
000147230201       ENDDO;
000148230201       *INLR = *ON;
000149230201       RETURN;
000150230201
000151230201       BEGSR RESET;
000152230201         VPRICE = 0;
000153230201         TERM = 60;
000154230201         RUSTPROTOP = ' ';
000155230201         RATE = 0;
000156230201         FREIGHT = 1200;
000157230201         ROADREADY = 599.99;
000158230201         RUSTPROT = 0;
000159230207         TRADEIN = 0;
000160230207         REBATE = 0;
000161230207         DPAYMENT = 0;
000162230207
000163230207
000164230201       ENDSR;
000165230201       BEGSR GETPAYMENT;
000166230207         IF RUSTPROTOP = 'Y';
000167230221           EVAL(H) RUSTPROT = VPRICE * 0.025;
000168230207         ENDIF;
000169230207         SUBTOTAL = VPRICE + FREIGHT + ROADREADY + RUSTPROT;
000170230220         EVAL(H) HST = SUBTOTAL * .13;
000171230207         TOTALOWED = SUBTOTAL + HST;
000172230207         MONEYOFF = TRADEIN + REBATE + DPAYMENT;
000173230207         PRINCIPAL = TOTALOWED - MONEYOFF;
000174230221         EVAL(H) PAYMENT = ((RATE/1200)*PRINCIPAL);
000176230207         TOTLOAN = PAYMENT * TERM;
000177230207         TOTINTPAID = TOTLOAN - PRINCIPAL;
000178230207       ENDSR;
000179230207
000180230207       BEGSR GETRATE;
000181230207         SELECT;
000182230207           WHEN TERM > 80;
000183230207             RATE = 99.99;
000184230207           WHEN TERM > 72;
000185230207             RATE = RATE + 1.25;
000186230207           WHEN TERM > 60;
000187230207             RATE = RATE + 0.75;
000188230207           WHEN TERM > 48;
000189230207             RATE = RATE;
000190230207           WHEN TERM > 36;
000191230207             RATE = RATE - 0.5;
000192230207           OTHER;
000193230207             RATE = RATE - 0.85;
000194230207         ENDSL;
000195230207       ENDSR;
000196230207
000197230207
000198230207
000199230201
