000100      
000101230411       Ctl-Opt      NoMain;
000102230411
000103230411       // (D) Copy in prototypes
000104230411       /Copy BC435A27/LAB8,CARPAYMNTP
000105230411
000106230411       DCL-Proc  CalcRate Export;
000107230411         Dcl-pi  *N Zoned(4:2);
000108230412           TERM Packed(2);
000109230411         END-PI;
000110230411
000111230411         Dcl-S RATE Zoned(4:2);
000112230411
000113230411          SELECT;
000114230411           WHEN TERM > 80;
000115230411             RATE = 99.99;
000116230411           WHEN TERM > 72;
000117230411             RATE = RATE + 1.25;
000118230411           WHEN TERM > 60;
000119230411             RATE = RATE + 0.75;
000120230411           WHEN TERM > 48;
000121230411             RATE = RATE;
000122230411           WHEN TERM > 36;
000123230411             RATE = RATE - 0.5;
000124230411           OTHER;
000125230411             RATE = RATE - 0.85;
000126230411         ENDSL;
000127230411
000128230411         Return RATE;
000129230411       END-PROC;
