000100230201       DCL-F  CARPAYDSP  WORKSTN;
000101230411       DCL-S  RATE ZONED(4:2);
000102230411       /Copy BC435A27/LAB8,CARPAYMNTP
000103230201       EXSR  RESET;
000104230201       EXFMT PURCHREC;
000105230201       DOW   *IN03 = *OFF;
000106230201         IF VPRICE <=  0;
000107230201           *IN30 = *ON;
000108230201           EXFMT PURCHREC;
000109230201           *IN30 = *OFF;
000110230201           ITER;
000111230201           ELSE;
000118230201             EXSR GETPAYMENT;
000119230201           ENDIF;
000120230201           IF RUSTPROTOP = ' ';
000121230201             *IN31 = *ON;
000122230201             EXFMT PURCHREC;
000123230201             *IN31 =*OFF;
000124230201             ITER;
000125230201           ENDIF;
000132230201           IF RATE <= 0;
000133230201             *IN32 = *ON;
000134230201             EXFMT PURCHREC;
000135230201             *IN32 = *OFF;
000136230201             ITER;
000137230201           ENDIF;
000138230412           RATE = CalcRate(TERM);
000139230201           *IN41 = *ON;
000140230201           WRITE PURCHREC;
000141230201           EXFMT LOANREC;
000142230201           *IN41 = *OFF;
000143230201
000144230201           IF NOT *IN03;
000145230201             EXSR RESET;
000146230201             EXFMT PURCHREC;
000147230201           ENDIF;
000148230201       ENDDO;
000149230201       *INLR = *ON;
000150230201       RETURN;
000151230201
000152230201       BEGSR RESET;
000153230201         VPRICE = 0;
000154230201         TERM = 60;
000155230201         RUSTPROTOP = ' ';
000156230201         RATE = 0;
000157230201         FREIGHT = 1200;
000158230201         ROADREADY = 599.99;
000159230201         RUSTPROT = 0;
000160230207         TRADEIN = 0;
000161230207         REBATE = 0;
000162230207         DPAYMENT = 0;
000163230207
000164230207
000165230201       ENDSR;
000166230201       BEGSR GETPAYMENT;
000167230207         IF RUSTPROTOP = 'Y';
000168230221           EVAL(H) RUSTPROT = VPRICE * 0.025;
000169230207         ENDIF;
000170230207         SUBTOTAL = VPRICE + FREIGHT + ROADREADY + RUSTPROT;
000171230220         EVAL(H) HST = SUBTOTAL * .13;
000172230207         TOTALOWED = SUBTOTAL + HST;
000173230207         MONEYOFF = TRADEIN + REBATE + DPAYMENT;
000174230207         PRINCIPAL = TOTALOWED - MONEYOFF;
000175230221         EVAL(H) PAYMENT = ((RATE/1200)*PRINCIPAL);
000176230207         TOTLOAN = PAYMENT * TERM;
000177230207         TOTINTPAID = TOTLOAN - PRINCIPAL;
000178230207       ENDSR;
000179230207
000196230207
000197230207
000198230207
000199230201
